package com.example.ilovepc.api.vo;

import lombok.Data;

/********************************************************************************************** 
 * @FileName : UploadResult.java 
 * @Date : 2022-12-27 
 * @작성자 : 정승주 
 * @설명 : 업로드 결과에 대한 상위 클래스
 **********************************************************************************************/ 

@Data
public class UploadResult {
    /*
     * code return 정의
     *  1 : 업로드 성공
     *  0 : 접근 오류 ( 필수 파라메터 누락)
     * -1 : 회원정보 오류( DB 매칭 실패 )
     * -2 : 파일 포멧 오류
     * -3 : 시스템 오류
     * */
    private int code = 100101;
    private String msg = "파일업로드를 성공했습니다.";
}
